/**
 * Реализуйте метод, который возвращает букву, стоящую в таблице
 * UNICODE после символа "\" (обратный слэш) на расстоянии a.
 * @autor Tikhonov Eugene
 * 14/09/2020
 */

package com.company;

public class Main {

    public static void main(String[] args) {
        char symbol = '/';
        int a = 1;
        System.out.println( (char) symbol + 1);
    }
}
